In [1]:
state_data = {'State':['Alabama','Alaska','Arizona','Arkansas'],'PostCode':['AL','AK','AZ','AR'],
              'Area':['52,423','656,424','*','53,182'],
              'Pop':['4,040,587','550,043','3,665,228','2,350,750']}

In [3]:
import pandas as pd
import numpy as np
state_data =  {'State':['Alabama','Alaska','Arizona','Arkansas'],'PostCode':['AL','AK','AZ','AR'],'Area':['52,423','656,424','*','53,182'],'Pop':['4,040,587','550,043','3,665,228','2,350,750']}
state_data

{'State': ['Alabama', 'Alaska', 'Arizona', 'Arkansas'],
 'PostCode': ['AL', 'AK', 'AZ', 'AR'],
 'Area': ['52,423', '656,424', '*', '53,182'],
 'Pop': ['4,040,587', '550,043', '3,665,228', '2,350,750']}

In [5]:
stdf = pd.DataFrame(state_data,columns=['State','PostCode','Area','Pop'])
stdf

      State PostCode     Area        Pop
0   Alabama       AL   52,423  4,040,587
1    Alaska       AK  656,424    550,043
2   Arizona       AZ        *  3,665,228
3  Arkansas       AR   53,182  2,350,750

In [7]:
print(stdf['Area'])
print()
print(stdf.Area)

0     52,423
1    656,424
2          *
3     53,182
Name: Area, dtype: object

0     52,423
1    656,424
2          *
3     53,182
Name: Area, dtype: object

In [9]:
stdf['Area'][0]

'52,423'

In [12]:
stdf = stdf.set_index('State')
stdf

         PostCode     Area        Pop
State
Alabama        AL   52,423  4,040,587
Alaska         AK  656,424    550,043
Arizona        AZ        *  3,665,228
Arkansas       AR   53,182  2,350,750

In [14]:
def item_replace(xstr):
    return xstr.replace(',','')
def star_replace(xstr):
    return xstr.replace('*','0')

In [16]:
stdf['Area'] = stdf['Area'].map(item_replace)
stdf

         PostCode    Area        Pop
State
Alabama        AL   52423  4,040,587
Alaska         AK  656424    550,043
Arizona        AZ       *  3,665,228
Arkansas       AR   53182  2,350,750

In [18]:
stdf['Pop'] = stdf['Pop'].map(item_replace)
stdf

         PostCode    Area      Pop
State
Alabama        AL   52423  4040587
Alaska         AK  656424   550043
Arizona        AZ       *  3665228
Arkansas       AR   53182  2350750

In [20]:
stdf['Area'] =stdf['Area'].map(star_replace)
stdf[['Area','Pop']] = stdf[['Area','Pop']].astype(float)
stdf

         PostCode      Area        Pop
State
Alabama        AL   52423.0  4040587.0
Alaska         AK  656424.0   550043.0
Arizona        AZ       0.0  3665228.0
Arkansas       AR   53182.0  2350750.0